---
kind: method
id: M:Autodesk.Revit.DB.ShapeImporter.IsServiceAvailable
source: html/74c90acb-a638-f840-afbe-d3cf5f78bf23.htm
---
# Autodesk.Revit.DB.ShapeImporter.IsServiceAvailable Method

Checks whether the data conversion service is available.

## Syntax (C#)
```csharp
public static bool IsServiceAvailable()
```

## Returns
True if the data conversion service is available, false otherwise.

## Remarks
ShapeImporter relies on optional data conversion functionality. This function checks whether it is available.